{
  "architectures": [
    "ModernBertHashModel"
  ],
  "attention_bias": false,
  "attention_dropout": 0.0,
  "auto_map": {
    "AutoModel": "modeling_doom_hash.ModernBertHashModel"
  },
  "bos_token_id": 2,
  "classifier_activation": "gelu",
  "classifier_bias": false,
  "classifier_dropout": 0.0,
  "classifier_pooling": "cls",
  "cls_token_id": 2,
  "decoder_bias": true,
  "depth_bins": 16,
  "deterministic_flash_attn": false,
  "dtype": "float32",
  "embedding_dropout": 0.0,
  "eos_token_id": 3,
  "global_attn_every_n_layers": 3,
  "global_rope_theta": 160000.0,
  "hash_projections": 16,
  "hidden_activation": "gelu",
  "hidden_size": 128,
  "initializer_cutoff_factor": 2.0,
  "initializer_range": 0.02,
  "intermediate_size": 512,
  "layer_norm_eps": 1e-05,
  "local_attention": 128,
  "local_rope_theta": 10000.0,
  "max_position_embeddings": 1536,
  "mlp_bias": false,
  "mlp_dropout": 0.0,
  "model_type": "modernbert",
  "norm_bias": false,
  "norm_eps": 1e-05,
  "num_attention_heads": 4,
  "num_hidden_layers": 5,
  "pad_token_id": 0,
  "repad_logits_with_grad": false,
  "sep_token_id": 3,
  "sparse_pred_ignore_index": -100,
  "sparse_prediction": false,
  "tie_word_embeddings": false,
  "transformers_version": "4.56.2",
  "use_cache": false,
  "vocab_size": 128
}
